src/Performance-Test/temp-becnhmark.txt
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking open-edx.vlabs.ac.in (be patient)


Server Software:        nginx/1.10.1
Server Hostname:        open-edx.vlabs.ac.in
Server Port:            80

Document Path:          /
Document Length:        99585 bytes

Concurrency Level:      190
Time taken for tests:   59.233 seconds
Complete requests:      1500
Failed requests:        0
Total transferred:      149986500 bytes
HTML transferred:       149377500 bytes
Requests per second:    25.32 [#/sec] (mean)
Time per request:       7502.908 [ms] (mean)
Time per request:       39.489 [ms] (mean, across all concurrent requests)
Transfer rate:          2472.78 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        9  402 581.8    212    7261
Processing:   611 4539 3302.5   3566   49817
Waiting:       46  478 583.6    252   10008
Total:        622 4941 3401.5   3984   51024

Percentage of the requests served within a certain time (ms)
  50%   3984
  66%   5106
  75%   6070
  80%   6805
  90%   9060
  95%  11333
  98%  13860
  99%  15436
 100%  51024 (longest request)